{
  "commandDescription": "invoke Aura component tests",
  "commandDescriptionLong": "Runs Aura component tests. The Lightning Testing Service (LTS) unmanaged package must be installed in your org. For details, see the LTS documentation.",
  "appnameFlagDescription": "name of your Lightning test application",
  "appnameFlagDescriptionLong": "Name of your Lightning test application. The name is case insensitive, and \".app\" is optional, so \"Test\" and \"test.app\" are equivalent.\nDefault value: Test.app",
  "outputdirDescription": "directory path to store test run artifacts: for example, log files and test results",
  "outputdirDescriptionLong": "Directory path to store test run artifacts: log files, test results, and so on.",
  "resultformatFlagDescription": "test result format emitted to stdout; --json flag overrides this parameter",
  "resultformatFlagDescriptionLong": "Format to use when displaying test results. If you also specify the --json flag, --json overrides this parameter.",
  "configfileDescription": "path to config file for the test",
  "configfileDescriptionLong": "Path to a test configuration file to configure WebDriver and other settings. For details, see the LTS documentation.",
  "leavebrowseropenDescription": "leave browser open",
  "leavebrowseropenDescriptionLong": "Leaves browser open after the test finishes so that you can view the test suite results.",
  "timeoutDescription": "time (ms) to wait for results element in dom",
  "timeoutDescriptionLong": "Time, in milliseconds, to wait for the results element to be present in the DOM, before failing and moving on to the next test.",
  "lightningTestCommandHelp": "Examples:\n   $ sfdx force:lightning:test:run\n   $ sfdx force:lightning:test:run -a tests -r human\n   $ sfdx force:lightning:test:run -f config/myConfigFile.json -d testResultFolder",
  "lightningTestInvalidReporter": "Unknown result format type. Must be one of the following values: %s",
  "lightningTestResultRetrievalFailed": "Unable to get test results: %s",
  "lightningTestBrowserError": "Something went wrong with the test app: %s",
  "scratchOrgOnly": "Lightning Testing Service can only run in scratch orgs, because tests can permanently change org data.",
  "waitNotNumber": "The value specified for wait argument, %s, is not a number.",
  "invalidType": "The value specified for type argument, %s, is invalid.",
  "invalidVersion": "Release tag %s doesn't exist. For the list of available releases, go to https://github.com/forcedotcom/LightningTestingService/releases.",
  "packageIdRetrievalIssue": "An error occurred trying to reach %s to retrieve the LTS package ID. See the debug log for details.",
  "packageIdExtractionIssue": "Unable to extract a package ID from the response from %s. See the debug log for details.",
  "testRunError": "Something went wrong with the test run. It might be an environmental or configuration issue.\nError Message: %s"
}
